@extends('layouts.app')

@section('content')

<main>
  <h2>адаптация вёрстки под ларавель с шаблонами</h2>
  <div class="maintext">
    <h3>моё хобби - щитпостинг</h3>
    <img src="https://sun9-27.userapi.com/impg/wL-oiqZckzzQ61aT9PQjLkTJ354z_0lyP-3eqg/1Q3yzwOuNgQ.jpg?size=600x1005&quality=95&sign=c35120588d8ebf44d76d5667c22176a9&type=album" width="320">
    <p>я не могу просто так придумать что либо без чётких указаний что должно быть как по теме так и по функциям</p>
    <p>тут я как в прошлый раз просто накидаю всякого</p>
    <p>полностью проигнорировав требования прям так и сдам</p>
    <p>хотя требования к проекту практики я так и не понял чё ваще надо чё должно быть какой функционал</p>
    <p>а функционал 4ой лабы я просто не умею и у меня сил нет даже с докой гайдами и пакетами типа бриза</p>
    <p>хоть мы и изучаем лару с 3го курса но как экстендить шаблоны я понял только сейчас</p>
    <p>я до сих пор понять не могу а вообще нравится ли мне это всё, хочу ли я заниматься вебом</p>
    <p>когда я поступал я ожидал написание программ локально, и на первом курсе так оно и было - у нас была информатика с с++</p>
    <p>но на втором курсе нежданно-негаданно начались хтмл ксс с дизайном и питоном на сдачу, джаваскрипта кстати по программе не было</p>
    <p>а сайты и веб как таковые мне никогда не были интересны</p>
    <p>но, конечно, спустя время изучения я вошёл во вкус я даже получаю некоторое удовольствие от примитивной вёрстки</p>
    <p>но я не ощущаю это чем-то серьёзным и понимаю что не смогу этим заниматься как нечто основное</p>
    <p>а как на 3ем курсе началась "разработка информационных систем" так я и начал задаваться вопросом "а надо ли оно вообще мне?"</p>
    <p>возможно это из-за "смятой" учебной программы, когда у нас второй год нет стабильности в расписании и дисциплинах</p>
    <p>когда нам дистант ставят следом после очной пары</p>
    <p>когда у нас две практики подряд из-за чего начинается неразбериха с другими предметами</p>
    <p>хотя вот так сидеть ночами и разбираться а как работает тот или иной кусок кода мне в самом деле интересно</p>
    <p>я просто хотел выговориться</p>
    <p>хотя бы в таком виде</p>
    <p>пусть даже это никто не увидит</p>
  </div>

  <div class="old">
    <span>переход на вторую страницу уже придумал чё будет</span>
    <button><a href="second">epic embed fail</a></button>
  </div>

  <div class="george2ch" >
    <h1>я закончил писать это в 3 часа ночи</h1>
    <img src="img/171021_9271.gif">
  </div>
  
</main>

@endsection

@section('footer', 'https://sun9-5.userapi.com/impf/c623331/v623331374/121bc/MmZ6n0SDDSA.jpg?size=610x464&quality=96&sign=059e1054717cb5c87aa9b32fc26d0503&type=album')